# GetTransparency Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectContext3DHandleSettings..::..GetTransparency Method
DirectContext3DHandleSettings Class See Also
---
Gets the transparency value of the handle and the associated DirectContext3D graphics.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public int GetTransparency()
```

Visual Basic
---
```text
Public Function GetTransparency As Integer
```

Visual C++
---
```text
public:
int GetTransparency()
```

# ### Return Value
The transparency value (in percentage)
# See Also
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace